[
    {
        "title": "DR",
        "first_name": "Eunice",
        "last_name": "Njeri Mwangi",
        "specialty": "Socially Intelligent Systems",
        "profile_picture": "./../static/img/people/principal_investigator/eunice-njeri.jpeg",
        "degree": "Joint PhD in Interactive Cognitive Environments, MSc in Software Engineering, BSc in Computer Technology (First Class Honors)",
        "pursuing": "Mainstreaming Responsible Computing",
        "focus_title": "Founder and Head of Social Robotics Research Lab",
        "focus_short": "Designing social behaviour for robots in educational settings.",
        "focus_long": "Dr. Eunice Njeri Mwangi is an expert in Socially Intelligent Systems with over 14 years of experience. She is the founder and head of the Social Robotics Research Lab at JKUAT. Her research focuses on leveraging robotics and AI to advance educational and health goals in Kenya and across Africa. She has received multiple fellowships and grant awards for her innovative work.",
        "quote": "Passionate about leveraging cutting-edge technologies, including robotics and AI, to advance educational and health goals in Kenya and across Africa.",
        "bio": "Dr. Eunice Njeri Mwangi is an award-winning Lecturer and Researcher with over 14 years of experience in Socially Intelligent Systems. She received a Joint PhD Degree in Interactive Cognitive Environments and has founded the Social Robotics Research Lab at JKUAT. Dr. Mwangi has conducted extensive research on social robotics in educational settings and has been recognized with several awards and fellowships. She actively organizes forums and workshops on AI, Robotics, and Responsible Computing in Kenya and Africa, and has published her work internationally.",
        "category": "I"
    },
    {
        "title": "MRS",
        "first_name": "Margaret",
        "last_name": "Ngugi",
        "specialty": "Msc. Software Engineer",
        "profile_picture": "./../static/img/people/admin/margaret.jpg",
        "degree": "Bachelor of Science in Information Technology",
        "pursuing": "Ms. Margaret Ngugi an Msc. Software engineering graduate is passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better",
        "focus_title": "Human Computer Interaction",
        "focus_short": "My passion for HCI is rooted in a desire to make technology work better for people, ensuring that it is not only functional but also a source of joy and empowerment in their lives. ",
        "focus_long": "My involvement in social robotics lab has been a transformative journey in my career. Taking the administrative roles and providing support to students as they design for responsible social aware systems has given me incredible insights. Witnessing students ideas evolve into tangible prototypes has been very fulfilling.I am currently delving into the field of cyber security to combine with my passion for HCI which can lead to innovative solutions that not only protect users but also empower them to interact with technology more confidently and effectively. ",
        "quote": "A passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better",
        "bio": "A passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better.",
        "category": "A"
    },
    {
        "title": "MR",
        "first_name": "Paul",
        "last_name": "Ndemo",
        "specialty": "Msc. Software Engineering Student",
        "profile_picture": "./../static/img/people/postgraduate/paul-ndemo.png",
        "degree": "Bachelor of Science in Electronic and Computer Engineering",
        "pursuing": "Master of Science Degree in Software Engineering at the Department of Computing, Department of Computing, School of Computing and Information Technology (JKUAT)",
        "focus_title": "State Transition Graphs (STGs)",
        "focus_short": "Using State Transition Graphs (STGs) in coordinating gazes between children with Autism Spectrum Disorder (ASD) and social robots to help them improve their social interaction skills.",
        "focus_long": "My research at the Social Robotics lab in JKUAT is about using State Transition Graphs (STGs) in coordinating gazes between children with Autism Spectrum Disorder (ASD) and social robots to help them improve their social interaction skills. Studies in other contexts have explored the use of STGs in coordinating tasks and found them to be effective in reducing complexity and improving task execution efficiency. Hence, his research aims to explore how STGs can be used to coordinate gazes for effective interactions between children with ASD and social robots",
        "quote": "A passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better",
        "bio": "A passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better.",
        "category": "P"
    },
    {
        "title": "MR",
        "first_name": "Eric",
        "last_name": "Otieno",
        "specialty": " Msc. Software Engineering Student",
        "profile_picture": "./../static/img/people/postgraduate/eric-otieno.png",
        "degree": "Bachelor of Science Degree in Computer Science",
        "pursuing": "Master of Science Degree in Software Engineering",
        "focus_title": "Human Fall Detection",
        "focus_short": "Human Fall Detection using an Ensemble Deep Learning model integrated with a social robot.",
        "focus_long": "My research at the  lab focuses on Human Fall Detection using an Ensemble Deep  Learning model integrated with a social robot. This research involves developing an ensemble model capable of detecting falls and integrating it with a robot to monitor the elderly and call for assistance whenever a fall is detected. This innovation aims to enhance the quality of life for the elderly by ensuring they receive immediate help in case of a fall",
        "quote": "A passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better",
        "bio": "An experienced Software Developer with expertise in the design, development, testing, and maintenance of software systems",
        "category": "P"
    },
    {
        "title": "MS",
        "first_name": "Caroline",
        "last_name": "Katumbi",
        "specialty": " Msc. Software Engineering Student",
        "profile_picture": "./../static/img/people/postgraduate/caroline-katumbi.png",
        "degree": "Bachelor of Science in Information Technology (First class honours)",
        "pursuing": "Master of Science Degree in Software Engineering",
        "focus_title": "Designing robot behavior",
        "focus_short": "Investigating how to design robot behavior while focusing on speech and gaze with the goal of proposing guidelines that can be used to enhance learning among children in a classroom setup",
        "focus_long": "At the JKUAT social robotics lab, my focus is on investigating how to design robot behavior while focusing on speech and gaze with the goal of proposing guidelines that can be used to enhance learning among children in a classroom setup. With the increased uptake of social robots in the classroom setup, this research project is aimed at designing acceptable social robots that provide natural and intuitive interactions.",
        "quote": "A passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better",
        "bio": "A dedicated and results-driven DevOps Engineer with a robust background in designing, implementing, and maintaining scalable and reliable systems",
        "category": "P"
    },
    {
        "title": "MR",
        "first_name": "Peter",
        "last_name": "Kabunyi",
        "specialty": "Msc. Software Engineering Student",
        "profile_picture": "./../static/img/people/postgraduate/peter-kabunyi.png",
        "degree": "Bachelors of Science in Computer Technology",
        "pursuing": "Master of Science Degree in Software Engineering",
        "focus_title": "Knowledge Graphs and semantic understanding",
        "focus_short": "Leveraging Knowledge Graphs to enhance the semantic understanding of text in robotics. This approach is particularly vital for designing a robot tutor tailored for visually impaired students",
        "focus_long": "At the social robotics lab, my work focuses on leveraging Knowledge Graphs to enhance the semantic understanding of text in robotics. This approach is particularly vital for designing a robot tutor tailored for visually impaired students. By utilizing Knowledge Graphs, we can create more intuitive and context-aware interactions, allowing the robot to understand and respond to the educational needs of these students more effectively. This work not only aims to improve the accessibility of education but also pushes the boundaries of how robots can be integrated into specialized learning environments",
        "quote": "A passionate software engineer who believes in using technology to create problem-solving solutions that make people's lives better",
        "bio": " A passionate, highly motivated and skilled professional with a passion for designing, developing, and implementing innovative software solutions",
        "category": "P"
    },
    {
        "first_name": "Daniel",
        "last_name": "Karume",
        "degree": "Bachelors of Science in Computer Science",
        "profile_picture": "./../static/img/people/undergraduate/daniel-karume.jpeg",
        "linked_in_link": "https://www.linkedin.com/in/daniel-karume/",
        "category": "U"
    },
    {
        "first_name": "Peaches",
        "last_name": "Njenga",
        "degree": "Bachelors of Science in Computer Science",
        "profile_picture": "./../static/img/people/undergraduate/peaches-njenga.jpeg",
        "linked_in_link": "https://www.linkedin.com/in/peaches-njenga/",
        "category": "U"
    },
    {
        "first_name": "Irke",
        "last_name": "Konzolo",
        "degree": "Bachelors of Science in Computer Science",
        "profile_picture": "./../static/img/people/undergraduate/irke-konzolo.jpeg",
        "linked_in_link": "https://www.linkedin.com/in/irke-konzolo/",
        "category": "U"
    },
    {
        "first_name": "Jeff",
        "last_name": "Kimani",
        "degree": "Bachelors of Science in Computer Science",
        "profile_picture": "./../static/img/people/undergraduate/jeff.jpg",
        "linked_in_link": "https://www.linkedin.com/in/jeff-chege-502387277/",
        "category": "U"
    },
    {
        "first_name": "Joseph",
        "last_name": "Kirika",
        "degree": "Bachelors of Science in Computer Science",
        "profile_picture": "./../static/img/people/undergraduate/joseph-kirika.jpeg",
        "linked_in_link": "https://www.linkedin.com/in/joseph-kirika-4a821b278/",
        "category": "U"
    }
]